## Plan Result (otel-collector-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11224425848)



<pre><code>Plan: 34 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_acm_certificate.application_alb_certificate_93966247
  * aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
  * aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_log_group.otel-collector-log-group
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
  * aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
  * aws_route53_record.application_alb_record_8EA9D3F9
  * aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
  * aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.application_ecs_service_ecs_security_group_231C6B1E



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_acm_certificate.application_alb_certificate_93966247 will be created
  + resource "aws_acm_certificate" "application_alb_certificate_93966247" {
      + arn                       = (known after apply)
      + domain_name               = "otel-collector.readitlater.com"
      + domain_validation_options = [
          + {
              + domain_name           = "otel-collector.readitlater.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "otel-collector.readitlater.com",
        ]
      + tags                      = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195 will be created
  + resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb.application_application_load_balancer_alb_05EA9801 will be created
  + resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "OTEL"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-610bdb3b",
          + "subnet-b2a036fa",
          + "subnet-cc66bde0",
          + "subnet-d09eb8ec",
        ]
      + tags                                                         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all                                                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be created
  + resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be created
  + resource "aws_alb_listener" "application_listener_https_D31CB055" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-1-2017-01"
      + tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + status_code  = "503"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F will be created
  + resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B will be created
  + resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "OTELbl"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
          + "type"           = "blue"
        }
      + tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
          + "type"           = "blue"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-867638e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/status"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6 will be created
  + resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "OTELgr"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
          + "type"           = "green"
        }
      + tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
          + "type"           = "green"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-867638e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/status"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "OtelCollector-Prod-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/OtelCollector-Prod/OtelCollector-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "OtelCollector-Prod-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/OtelCollector-Prod/OtelCollector-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 20
      + min_capacity       = 4
      + resource_id        = "service/OtelCollector-Prod/OtelCollector-Prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED will be created
  + resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "OtelCollector-Prod"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_group.otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/OtelCollector-Prod/ecs/otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to reduce capacity if container CPU is low"
      + alarm_name                            = "OtelCollector-Prod Service Low CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "OtelCollector-Prod"
          + "ServiceName" = "OtelCollector-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to add capacity if container CPU is high"
      + alarm_name                            = "OtelCollector-Prod Service High CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "OtelCollector-Prod"
          + "ServiceName" = "OtelCollector-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + threshold                             = 45
      + treat_missing_data                    = "notBreaching"
    }

  # aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF will be created
  + resource "aws_codedeploy_app" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "OtelCollector-Prod-ECS"
      + tags                = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
    }

  # aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247 will be created
  + resource "aws_codedeploy_deployment_group" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247" {
      + app_name                    = "OtelCollector-Prod-ECS"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "OtelCollector-Prod-ECS"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "OtelCollector-Prod"
          + service_name = "OtelCollector-Prod"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = (known after apply)
                }
              + target_group {
                  + name = (known after apply)
                }
              + target_group {
                  + name = (known after apply)
                }
            }
        }
    }

  # aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE will be created
  + resource "aws_codestarnotifications_notification_rule" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE" {
      + arn            = (known after apply)
      + detail_type    = "BASIC"
      + event_type_ids = [
          + "codedeploy-application-deployment-failed",
        ]
      + id             = (known after apply)
      + name           = "OtelCollector-Prod-ECS"
      + resource       = "arn:aws:codedeploy:us-east-1:996905175585:application:OtelCollector-Prod-ECS"
      + status         = "ENABLED"
      + tags           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }

      + target {
          + address = "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot"
          + status  = (known after apply)
          + type    = "SNS"
        }
    }

  # aws_ecs_cluster.application_ecs_cluster_4DC6EFB3 will be created
  + resource "aws_ecs_cluster" "application_ecs_cluster_4DC6EFB3" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "OtelCollector-Prod"
      + tags     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be created
  + resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "OtelCollector-Prod"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "otel-collector"
          + container_port   = 80
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "DEPLOYMENT_ENVIRONMENT_NAME"
                          + value = "prod"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost/status || exit 1",
                        ]
                      + interval    = 15
                      + retries     = 3
                      + startPeriod = 0
                      + timeout     = 5
                    }
                  + image                  = "pocket/opentelemetry-collector-contrib"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/OtelCollector-Prod/ecs/otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "otel-collector"
                  + portMappings           = []
                  + readonlyRootFilesystem = false
                  + repositoryCredentials  = {
                      + credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  + secrets                = [
                      + {
                          + name      = "GOOGLE_APPLICATION_CREDENTIALS_JSON"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/GCP_SA_TRACES:::"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "OtelCollector-Prod"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77 will be created
  + resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "OtelCollector-Prod-TaskExecutionRolePolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/*",
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared",
                          + "arn:aws:kms:us-east-1:996905175585:key/fee9bd90-a01f-4212-8b69-9c149a7cdb15",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
    }

  # aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA will be created
  + resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "OtelCollector-Prod-TaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED will be created
  + resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-task-role_A72990ED" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "OtelCollector-Prod-TaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3 will be created
  + resource "aws_iam_role" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "OtelCollector-Prod-ECSCodeDeployRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725 will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "OtelCollector-Prod-ECSCodeDeployRole"
    }

  # aws_route53_record.application_alb_certificate_certificate_record_51B45CF2 will be created
  + resource "aws_route53_record" "application_alb_certificate_certificate_record_51B45CF2" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.application_alb_record_8EA9D3F9 will be created
  + resource "aws_route53_record" "application_alb_record_8EA9D3F9" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "otel-collector.readitlater.com"
      + set_identifier  = "1"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }

      + weighted_routing_policy {
          + weight = 1
        }
    }

  # aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22 will be created
  + resource "aws_route53_record" "application_base_dns_subhosted_zone_ns_DFB88A22" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "otel-collector.readitlater.com"
      + records         = (known after apply)
      + ttl             = 86400
      + type            = "NS"
      + zone_id         = "Z2BHWTOWFVNW3M"
    }

  # aws_route53_zone.application_base_dns_subhosted_zone_77521D1C will be created
  + resource "aws_route53_zone" "application_base_dns_subhosted_zone_77521D1C" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "otel-collector.readitlater.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + zone_id             = (known after apply)
    }

  # aws_security_group.application_application_load_balancer_alb_security_group_7B45D070 will be created
  + resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
      + arn                    = (known after apply)
      + description            = "External security group  (Managed by Terraform)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "OtelCollector-Prod-HTTP/S Security Group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"           = "OtelCollector-Prod-HTTP/S Security Group"
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all               = {
          + "Name"           = "OtelCollector-Prod-HTTP/S Security Group"
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + vpc_id                 = "vpc-867638e3"
    }

  # aws_security_group.application_ecs_service_ecs_security_group_231C6B1E will be created
  + resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
      + arn                    = (known after apply)
      + description            = "Internal ECS Security Group (Managed by Terraform)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "required"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "OtelCollector-Prod-ECSSecurityGroup"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + tags_all               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-otelcollector"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "OtelCollector"
        }
      + vpc_id                 = "vpc-867638e3"
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs-application-url    = "otel-collector.readitlater.com"
  + ecs-clusterName        = "OtelCollector-Prod"
  + ecs-codedeploy-app     = "OtelCollector-Prod-ECS"
  + ecs-codedeploy-group   = "OtelCollector-Prod-ECS"
  + ecs-serviceName        = "OtelCollector-Prod"
  + ecs-task-arn           = (known after apply)
  + ecs-task-containerName = "otel-collector"
  + ecs-task-containerPort = 80
  + ecs-task-family        = "OtelCollector-Prod"
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":800,"Program":"tfcmt","SHA1":"f31ac39453b95c425cf5bf191a887ed0ae45703a","Target":"otel-collector-cdk-production","Vars":{},"WorkflowName":"OTEL Collector"} -->